var banks = ["中国工商银行","中国建设银行","中国农业银行","中国银行","交通银行","招商银行","上海浦东发展银行","中国民生银行","深圳发展银行","广东发展银行","中信银行","华夏银行","兴业银行","广州市农村信用合作社","广州市商业银行","上海农村商业银行","中国邮政储蓄","中国光大银行","上海银行","北京银行","渤海银行","徽商银行","长沙市商业银行","汇丰银行","深圳平安银行","东亚银行","杭州银行","江苏银行","农信银中心","农村商业银行","城市商业银行","农村信用合作社","南京市商业银行","宁波银行","花旗银行","广州银联","中国银联","吉林银行"];
var sel = $('.banks'),html='';
$(function(){
    oBanks();
});
//初始化省
var oBanks = function(){
    html = '';
    $.each(banks,function(i,v){
        html+="<option value='"+v+"'>"+v+"</option>";
    });
    sel.html(html);
};